W7D3/goal_setter/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "age", "email", "created_at", "updated_at", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"